In [1]:
import pandas as pd
import numpy as np

s1 = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [2]:
s1[0]

/tmp/ipykernel_56883/643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

0.0

In [3]:
s1['a']

0.0

In [4]:
s1[['a','b']]

a    0.0
b    1.0
dtype: float64

In [13]:
#slice
s1['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [7]:
#搜尋值
s1[s1 == 2.0]

c    2.0
dtype: float64

In [10]:
s1[s1 >= 2]

c    2.0
d    3.0
dtype: float64

In [15]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
df

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [16]:
df['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [17]:
df[['one','three']]

    one  three
台北    0      2
台中    4      6
台南    8     10
高雄   12     14

In [19]:
#iloc,loc
df.loc[['台北','台中']]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [23]:
df[df < 5] = 0.0

In [24]:
df

    one  two  three  four
台北    0    0      0     0
台中    0    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [29]:
df1 = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
df1[df1['four'] < 10]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [35]:
df1.loc['高雄'] >= 13

one      False
two       True
three     True
four      True
Name: 高雄, dtype: bool